Autodesk.Revit.DB.ElementCache.AdditionalParameters
Additional parameters array, see additionalParamIds in the constructor

Autodesk.Revit.DB.ElementCache.SortedPublicParameters
Sorted parameters array which is provided by publicListParams